package t2_basic_java;

public class Topic5 {
    /*
        1.基本的数据结构
            （1）数组
            （2）链表
                有一些典型题目
            （3）栈
            （4）队列
            （5）堆
            （6）优先队列
            （7）树
                二叉树：先序遍历、中序遍历、后序遍历
            （8）图
                深度优先遍历
                广度优先遍历

        2.迭代和递归

        3.排序算法
            八大排序算法

        4.空间复杂度和时间复杂度

        5.查找算法
            二分查找
            Hash
            B+ Tree（Mysql 索引的实现）
        6.大数据排序

     */
}
